In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
s1 = Series([5,np.nan,6,np.nan])
s1

0    5.0
1    NaN
2    6.0
3    NaN
dtype: float64

In [6]:
s2 = Series(np.arange(4))
s2

0    0
1    1
2    2
3    3
dtype: int32

In [7]:
s3 = Series(np.where(pd.isnull(s1),s2,s1))
s3

0    5.0
1    1.0
2    6.0
3    3.0
dtype: float64

In [9]:
s4 = s1.combine_first(s2)
s4

0    5.0
1    1.0
2    6.0
3    3.0
dtype: float64

In [17]:
#combining two DataFrame

df1 = DataFrame(
{
    '1':[5,np.nan,15],
    '2':[20,25,np.nan],
    '3':[np.nan,np.nan,25]
}
)
df1

      1     2     3
0   5.0  20.0   NaN
1   NaN  25.0   NaN
2  15.0   NaN  25.0

In [18]:
df2 = DataFrame(
{
    '1':[5,10,15],
    '2':[20,25,30]
}
)
df2

    1   2
0   5  20
1  10  25
2  15  30

In [19]:
df1.combine_first(df2)

      1     2     3
0   5.0  20.0   NaN
1  10.0  25.0   NaN
2  15.0  30.0  25.0

In [20]:
df2.combine_first(df1)

      1     2     3
0   5.0  20.0   NaN
1  10.0  25.0   NaN
2  15.0  30.0  25.0